/*
 * @(#) mgaDefs.h 11.1 97/10/22
 *
 * Copyright (C) 1994-1995 The Santa Cruz Operation, Inc.
 *
 * The information in this file is provided for the exclusive use of the
 * licensees of The Santa Cruz Operation, Inc.  Such users have the right
 * to use, modify, and incorporate this code into other products for purposes
 * authorized by the license agreement provided they include this notice
 * and the associated copyright notice with any such product.  The
 * information in this file is provided "AS IS" without warranty.
 *
 */

/*
 *	S000	Thu Jun  1 16:52:52 PDT 1995	brianm@sco.com
 *	- New code from Matrox.
 */

#ifndef _mgadefs_h_
#define _mgadefs_h_

extern unsigned long mgaALU[16];

/* mga source or destination window def (I hope) */

typedef struct _mgaSDWin
{
	unsigned char window[0x1c00];
} mgaSDWin, *mgaSDWinPtr;

/*** As per Titan (Drawing Engine) specification 1.0 ***/

typedef struct _mgaTitanDrawRegs
{
	unsigned long dwgctl;          /* 0x000 */
	unsigned long maccess;         /* 0x004 */
	unsigned long mctlwtst;        /* 0x008 */
	unsigned long unused0;         /* 0x00C */
	unsigned long dst0;            /* 0x010 */
	unsigned long dst1;            /* 0x014 */
	unsigned long zmsk;            /* 0x018 */
	unsigned long plnwt;           /* 0x01C */
	unsigned long bcol;            /* 0x020 */
	unsigned long fcol;            /* 0x024 */
	unsigned long unused1;         /* 0x028 */
	unsigned long srcblt;          /* 0x02C */
	unsigned long src0;            /* 0x030 */
	unsigned long src1;            /* 0x034 */
	unsigned long src2;            /* 0x038 */
	unsigned long src3;            /* 0x03C */
	unsigned long xystrt;          /* 0x040 */
	unsigned long xyend;           /* 0x044 */
	unsigned long unused2;         /* 0x048 */
	unsigned long unused3;         /* 0x04C */
	unsigned long shift;           /* 0x050 */
	unsigned long unused4;         /* 0x054 */
	unsigned long sgn;             /* 0x058 */
	unsigned long len;             /* 0x05C */
	unsigned long ar0;             /* 0x060 */
	unsigned long ar1;             /* 0x064 */
	unsigned long ar2;             /* 0x068 */
	unsigned long ar3;             /* 0x06C */
	unsigned long ar4;             /* 0x070 */
	unsigned long ar5;             /* 0x074 */
	unsigned long ar6;             /* 0x078 */
	unsigned long unused5[4];      /* 0x07C-88 */
	unsigned long pitch;           /* 0x08C */
	unsigned long ydst;            /* 0x090 */
	unsigned long ydstorg;         /* 0x094 */
	unsigned long ytop;            /* 0x098 */
	unsigned long ybot;            /* 0x09C */
	unsigned long cxleft;          /* 0x0A0 */
	unsigned long cxright;         /* 0x0A4 */
	unsigned long fxleft;          /* 0x0A8 */
	unsigned long fxright;         /* 0x0AC */
	unsigned long xdst;            /* 0x0B0 */
	unsigned long unused6[3];      /* 0x0B4-BC */
	unsigned long dr0;             /* 0x0C0 */
	unsigned long dr1;             /* 0x0C4 */
	unsigned long dr2;             /* 0x0C8 */
	unsigned long dr3;             /* 0x0CC */
	unsigned long dr4;             /* 0x0D0 */
	unsigned long dr5;             /* 0x0D4 */
	unsigned long dr6;             /* 0x0D8 */
	unsigned long dr7;             /* 0x0DC */
	unsigned long dr8;             /* 0x0E0 */
	unsigned long dr9;             /* 0x0E4 */
	unsigned long dr10;            /* 0x0E8 */
	unsigned long dr11;            /* 0x0EC */
	unsigned long dr12;            /* 0x0F0 */
	unsigned long dr13;            /* 0x0F4 */
	unsigned long dr14;            /* 0x0F8 */
	unsigned long dr15;            /* 0x0FC */
} magaTitanDrawRegs;

/*** As per Titan (Host Interface VGA/CRTC) specification 0.2 ***/

typedef struct _vgaRegs
{
	unsigned char crtc_addr0;      /* io space 0x3b0 */
	unsigned char crtc_data0;      /* io space 0x3b1 */
	unsigned char crtc_addr1;      /* io space 0x3b2 */
	unsigned char crtc_data1;      /* io space 0x3b3 */
	unsigned char crtc_addr2;      /* io space 0x3b4 */
	unsigned char crtc_data2;      /* io space 0x3b5 */
	unsigned char crtc_addr3;      /* io space 0x3b6 */
	unsigned char crtc_data3;      /* io space 0x3b7 */
	unsigned char her_mode;        /* io space 0x3b8 */
	unsigned char her_lp_set;      /* io space 0x3b9 */
	unsigned char misc_istat1;     /* io space 0x3ba */
	unsigned char her_lp_clr;      /* io space 0x3bb */
	unsigned char unused0[3];      /* io space 0x3bc-0x3be */
	unsigned char her_conf;        /* io space 0x3bf */
	unsigned char attr_addr;       /* io space 0x3c0 */
	unsigned char attr_data;       /* io space 0x3c1 */
	unsigned char misc_istat0;     /* io space 0x3c2 */
	unsigned char vga_subsys;      /* io space 0x3c3 */
	unsigned char seq_addr;        /* io space 0x3c4 */
	unsigned char seq_data;        /* io space 0x3c5 */
	unsigned char unused1;         /* io space 0x3c6 */
	unsigned char dac_status;      /* io space 0x3c7 */
	unsigned char unused2[2];      /* io space 0x3c8-3c9 */
	unsigned char feat_ctl_r;      /* io space 0x3ca */
	unsigned char unused3;         /* io space 0x3cb */
	unsigned char misc_out;        /* io space 0x3cc */
	unsigned char unused4;         /* io space 0x3cd */
	unsigned char gctl_addr;       /* io space 0x3ce */
	unsigned char gctl_data;       /* io space 0x3cf */
	unsigned char crtc_addr4;      /* io space 0x3d0 */
	unsigned char crtc_data4;      /* io space 0x3d1 */
	unsigned char crtc_addr5;      /* io space 0x3d2 */
	unsigned char crtc_data5;      /* io space 0x3d3 */
	unsigned char crtc_addr6;      /* io space 0x3d4 */
	unsigned char crtc_data6;      /* io space 0x3d5 */
	unsigned char crtc_addr7;      /* io space 0x3d6 */
	unsigned char crtc_data7;      /* io space 0x3d7 */
	unsigned char cga_mode;        /* io space 0x3d8 */
	unsigned char cga_col_sl;      /* io space 0x3d9 */
	unsigned char misc_istat11;    /* io space 0x3da */
	unsigned char cga_lp_clr;      /* io space 0x3db */
	unsigned char cga_lp_set;      /* io space 0x3dc */
	unsigned char unused7;         /* io space 0x3dd */
	unsigned char aux_addr;        /* io space 0x3de */
	unsigned char aux_data;        /* io space 0x3df */
	unsigned char unused8[32];     /* io space 0x3e0-3ff */
} vgaRegs, *vgaRegsPtr;

#define misc_outr misc_out
#define misc_outw misc_istat0
#define feat_ctl0 misc_istat1
#define feat_ctl1 misc_istat11

typedef struct _mgaTitanRegs
{

	magaTitanDrawRegs drawSetup;	/* 0-ff */
	magaTitanDrawRegs drawGo;	/* 100-1ff */

/*** As per Titan (Host Interface Non-VGA) specification 0.2 ***/
                              
	unsigned long srcpage;         /* 0x200 */
	unsigned long dstpage;         /* 0x204 */
	unsigned long bytaccdata;      /* 0x208 */
	unsigned long adrgen;          /* 0x20c */
	unsigned long fifostatus;      /* 0x210 */
	unsigned long status;          /* 0x214 */
	unsigned long iclear;          /* 0x218 */
	unsigned long ien;             /* 0x21c */
	unsigned long unused0[2];      /* 0x220,224 */
	unsigned long intsts;	       /* 0x228 */
	unsigned long unused1[5];      /* 0x22c-23c */
	unsigned long rst;             /* 0x240 */
	unsigned long test;            /* 0x244 */
	unsigned long rev;             /* 0x248 */
	unsigned long unused2;         /* 0x24c */
	unsigned long config;          /* 0x250 */
	unsigned long opmode;          /* 0x254 */
	unsigned long unused3;         /* 0x258 */
	unsigned long crtc_ctrl;       /* 0x25c */
	unsigned char unused4[0x3b0 - 0x260]; /* 260-3af, offset to vga regs */
	vgaRegs vga;
} mgaTitanRegs, *mgaTitanRegsPtr;

/*** As per Dubic specification 0.2 ***/

typedef struct _mgaDubicRegs
{
	unsigned char dub_sel;      /* 0x00   BYTE ACCESSES ONLY ***/
	unsigned char unused0[3];
	unsigned char ndx_ptr;      /* 0x04   BYTE ACCESSES ONLY ***/
	unsigned char unused1[3];
	unsigned char data;         /* 0x08   BYTE ACCESSES ONLY ***/
	unsigned char unused2[3];
	unsigned char dub_mous;     /* 0x0c   BYTE ACCESSES ONLY ***/
	unsigned char unused3[3];
	unsigned char mouse0;       /* 0x10   BYTE ACCESSES ONLY ***/
	unsigned char unused4[3];
	unsigned char mouse1;       /* 0x14   BYTE ACCESSES ONLY ***/
	unsigned char unused5[3];
	unsigned char mouse2 ;      /* 0x18   BYTE ACCESSES ONLY ***/
	unsigned char unused6[3];
	unsigned char mouse3;       /* 0x1c   BYTE ACCESSES ONLY ***/
	unsigned char unused7[3];

} mgaDubicRegs, *mgaDubicRegsPtr;

/*****************************************************************************

 RAMDAC rgisters

*/

/*** DIRECT ***/

typedef struct _mgaBt481
{
	unsigned char wadr_pal;			/* 0x00 */
	unsigned char unused0[3];
	unsigned char col_pal;			/* 0x04 */
	unsigned char unused1[3];
	unsigned char pix_rd_msk;		/* 0x08 */
	unsigned char unused2[3];
	unsigned char radr_pal;			/* 0x0c */
	unsigned char unused3[3];
	unsigned char wadr_ovl;			/* 0x10 */
	unsigned char unused4[3];
	unsigned char col_ovl;			/* 0x14 */
	unsigned char unused5[3];
	unsigned char cmd_rega;			/* 0x18 */
	unsigned char unused6[3];
	unsigned char radr_ovl;			/* 0x1c */
	unsigned char unused7[3];

} mgaBt481, *mgaBt481Ptr;

/*** DIRECT ***/

typedef struct _mgaBt482
{
	unsigned char wadr_pal;			/* 0x00 */
	unsigned char unused0[3];
	unsigned char col_pal;			/* 0x04 */
	unsigned char unused1[3];
	unsigned char pix_rd_msk;		/* 0x08 */
	unsigned char unused2[3];
	unsigned char radr_pal;			/* 0x0c */
	unsigned char unused3[3];
	unsigned char wadr_ovl;			/* 0x10 */
	unsigned char unused4[3];
	unsigned char col_ovl;			/* 0x14 */
	unsigned char unused5[3];
	unsigned char cmd_rega;			/* 0x18 */
	unsigned char unused6[3];
	unsigned char radr_ovl;			/* 0x1c */
	unsigned char unused7[3];
} mgaBt482, *mgaBt482Ptr;


/*** DIRECT ***/

typedef struct _mgaBt484
{
	unsigned char wadr_pal;			/* 0x00 */
	unsigned char unused0[3];
	unsigned char col_pal;			/* 0x04 */
	unsigned char unused1[3];
	unsigned char pix_rd_msk;		/* 0x08 */
	unsigned char unused2[3];
	unsigned char radr_pal;			/* 0x0c */
	unsigned char unused3[3];
	unsigned char wadr_ovl;			/* 0x10 */
	unsigned char unused4[3];
	unsigned char col_ovl;			/* 0x14 */
	unsigned char unused5[3];
	unsigned char cmd_reg0;			/* 0x18 */
	unsigned char unused6[3];
	unsigned char radr_ovl;			/* 0x1c */
	unsigned char unused7[3];
	unsigned char cmd_reg1;			/* 0x20 */
	unsigned char unused8[3];
	unsigned char cmd_reg2;			/* 0x24 */
	unsigned char unused9[3];
	unsigned char status;			/* 0x28 */
	unsigned char unuseda[3];
	unsigned char cur_ram; 			/* 0x2c */
	unsigned char unusedb[3];
	unsigned char cur_xlow;			/* 0x30 */
	unsigned char unusedc[3];
	unsigned char cur_xhi; 			/* 0x34 */
	unsigned char unusedd[3];
	unsigned char cur_ylow;			/* 0x38 */
	unsigned char unusede[3];
	unsigned char cur_yhi; 			/* 0x3c */
	unsigned char unusedf[3];
} mgaBt484, *mgaBt484Ptr;


typedef struct _mgaBt485
{
	unsigned char wadr_pal;			/* 0x00 */
	unsigned char unused0[3];
	unsigned char col_pal;			/* 0x04 */
	unsigned char unused1[3];
	unsigned char pix_rd_msk;		/* 0x08 */
	unsigned char unused2[3];
	unsigned char radr_pal;			/* 0x0c */
	unsigned char unused3[3];
	unsigned char wadr_ovl;			/* 0x10 */
	unsigned char unused4[3];
	unsigned char col_ovl;			/* 0x14 */
	unsigned char unused5[3];
	unsigned char cmd_reg0;			/* 0x18 */
	unsigned char unused6[3];
	unsigned char radr_ovl;			/* 0x1c */
	unsigned char unused7[3];
	unsigned char cmd_reg1;			/* 0x20 */
	unsigned char unused8[3];
	unsigned char cmd_reg2;			/* 0x24 */
	unsigned char unused9[3];
	unsigned char status;			/* 0x28 */
	unsigned char unuseda[3];
	unsigned char cur_ram; 			/* 0x2c */
	unsigned char unusedb[3];
	unsigned char cur_xlow;			/* 0x30 */
	unsigned char unusedc[3];
	unsigned char cur_xhi; 			/* 0x34 */
	unsigned char unusedd[3];
	unsigned char cur_ylow;			/* 0x38 */
	unsigned char unusede[3];
	unsigned char cur_yhi; 			/* 0x3c */
	unsigned char unusedf[3];
} mgaBt485, *mgaBt485Ptr;

#define cmd_reg3 status				/* 0x28 */


/*****************************************************************************/

/*** VIEWPOINT REGISTER DIRECT ***/

typedef struct _mgaViewPoint
{
	unsigned char wadr_pal;			/* 0x00 */
	unsigned char unused0[3];
	unsigned char col_pal;			/* 0x04 */
	unsigned char unused1[3];
	unsigned char pix_rd_msk;		/* 0x08 */
	unsigned char unused2[3];
	unsigned char radr_pal;			/* 0x0c */
	unsigned char unused3[3];
	unsigned char unused4[8];		/* 0x10-14 */
	unsigned char index;			/* 0x18 */
	unsigned char unused5[3];
	unsigned char data;			/* 0x1c */
	unsigned char unused6[3];
} mgaViewPoint, *mgaViewPointPtr;

/*** TVP3026 REGISTER DIRECT ***/

typedef struct _mgaTVP3026
{
	unsigned char index;  			/* 0x00 *//* same as wadr_pal */
	unsigned char unused0[3];
	unsigned char col_pal;			/* 0x04 */
	unsigned char unused1[3];
	unsigned char pix_rd_msk;		/* 0x08 */
	unsigned char unused2[3];
	unsigned char radr_pal;			/* 0x0c */
	unsigned char unused3[3];
	unsigned char cur_col_addr;	/* 0x10 */
	unsigned char unused4[3];
	unsigned char cur_col_data;	/* 0x14 */
	unsigned char unused5[19];
	unsigned char data;  			/* 0x28 */
	unsigned char unused6[3];
	unsigned char cur_ram; 			/* 0x2c */
	unsigned char unused7[3];
        unsigned char cur_xlow;			/* 0x30 */
	unsigned char unused8[3];
	unsigned char cur_xhi; 			/* 0x34 */
	unsigned char unused9[3];
	unsigned char cur_ylow;			/* 0x38 */
	unsigned char unuseda[3];
	unsigned char cur_yhi; 			/* 0x3c */
	unsigned char unusedb[3];
} mgaTVP3026, *mgaTVP3026Ptr;

typedef union _mgaDacs
{
    mgaBt481 bt481;
    mgaBt482 bt482;
    mgaBt484 bt484;
    mgaBt485 bt485;
    mgaViewPoint vpoint;
    mgaTVP3026 tvp3026;
} mgaDacs, *mgaDacsPtr;

typedef struct _mgaRegs
{
    mgaSDWin srcwin;
    mgaTitanRegs titan;
    mgaSDWin dstwin;
    mgaDacs  ramdacs;
    unsigned char unused0[0x80 - sizeof(mgaDacs)];
    mgaDubicRegs dubic;
    unsigned char unused1[0x80 - sizeof(mgaDubicRegs)];
    unsigned char viwic[0x80];	/* place holder 'till I know what this is */
    unsigned char clkgen[0x80];	/* place holder 'till I know what this is */
    unsigned char expdev[0x200];/* place holder 'till I know what this is */

} mgaRegs, *mgaRegsPtr;


/*****************************************************************************

 DUBIC INDEX TO REGISTERS (NDX_PTR)

 These are the index values to access the Dubic indexed registers via NDX_PTR

*/

